document.addEventListener('DOMContentLoaded', () => {
    // Словарь с переводами
    const translations = {
        kg: {
            // Заголовки и кнопки
            mainTitle: 'Пландар жана максаттар',
            mainSubtitle: 'Кара-Кулжа жергиликтүү мамлекеттик администрациясынын 2024-жылдын 27-августундагы № 01-12/275 буйругуна тиркеме',
            planTitle: '2025-2030-жылдарга коррупцияга каршы аракеттенүү боюнча мамлекеттик стратегияны ишке ашыруу боюнча иш-чаралардын планы',

            // Заголовки таблицы
            col1: '№',
            col2: 'Милдеттер',
            col3: 'Иш-чаралар',
            col4: 'Мөөнөттөрү',
            col5: 'Натыйжалар',
            col6: 'Жооптуулар',
            col7: 'Каржылоо',

            // Главы
            chapter1Title: 'Глава 1. Коррупцияга каршы мыйзамды өркүндөтүү, аны практикада колдонуунун натыйжалуулугүн камсыздоо',
            chapter2Title: 'Глава 2. Социалдык чөйрөнүн жана экономиканын тармактарында жарандардын мамлекеттик бийлик органдары менен өз ара аракеттенүүсүндө коррупциялык көрүнүштөрдүн алдын алуу',
            chapter3Title: 'Глава 3. Мамлекеттик каражаттарды башкаруу, финансылык контролдоо системаларын жана сатып алуу жол-жоболорун өркүндөтүү',
            chapter4Title: 'Глава 4. Санариптештирүү процесстерин өнүктүрүү жана азыркы этапта коррупцияга каршы күрөшүүнүн натыйжалуу чараларынын бири катары мамлекеттик жана муниципалдык түзүмдөрдүн ишине маалыматтык технологияларды киргизүү',
            chapter5Title: 'Глава 5. Коррупцияны изилдөө',
            chapter6Title: 'Глава 6. Коррупцияга каршы аракеттенүү жаатындагы эл аралык кызматташтык',
            chapter7Title: 'Глава 7. Стратегияны ишке ашыруу механизмдери, финансы ресурстары',
            chapter8Title: 'Глава 8. Стратегияны ишке ашыруу процесстерине мониторинг жана баалоо жүргүзүү',

            // Текст внутри глав
            chapter1Row1Task: 'Мамлекеттик органдардын жана ЖӨБО кызматчылары үчүн коррупцияга каршы мыйзамдарды колдонуу боюнча окуу тренингдерин уюштуруу',
            chapter1Row1Actions: '2026-жыл',
            chapter1Row1Deadline: 'Окуу системасынын программасынын негизинде мамлекеттик органдардын жана ЖӨБО кызматчылары үчүн коррупцияга каршы аракеттенүү жаатында жаңыдан кабыл алынган мыйзам актыларын колдонуу боюнча окуу тренингдери өткөрүлөт',
            chapter1Row1Results: 'ОЮ, ЖМА, ЖӨБО, мамлекеттик органдар',
            chapter1Row1Responsible: 'Республикалык бюджет мамлекеттик органдар үчүн каралган каражаттардын чегинде. Өнүктүрүү боюнча өнөктөштөрдүн каражаттары',
            chapter1Row1Funding: 'Республикалык бюджет мамлекеттик органдар үчүн каралган каражаттардын чегинде. Өнүктүрүү боюнча өнөктөштөрдүн каражаттары',

            chapter2Row1Task: 'Мамлекеттик башкаруу жана жергиликтүү өз алдынча башкаруу системасынын кызматкерлеринин коррупциялык мотивациясын төмөндөтүү',
            chapter2Row1Actions: 'Жогорку квалификациялуу адистерди тартуу жана кадрдык потенциалды сактоо үчүн шарттарды жакшыртуу, мамлекеттик органдарда жана ЖӨБО иштин кадырбаркын жана жагымдуулугун жогорулатуу жана мамлекеттик башкаруу секторунда коррупциялык тобокелдиктердин болушун төмөндөтүү боюнча чаралардын комплексин иштеп чыгуу',
            chapter2Row1Deadline: '2025-2027-жылдар',
            chapter2Row1Results: 'Мамлекеттик жана муниципалдык кызмат орундарына кадрларды тандоо жана системаны жакшыртуу боюнча чаралар көрүлөт',
            chapter2Row1Responsible: 'ЖӨБО, мамлекеттик органдар',
            chapter2Row1Funding: 'Мамлекеттик органдарга жана ЖӨБО бөлүнгөн каражаттардын чегинде',

            chapter2Row2Task: 'Мамлекеттик башкаруу системасында коррупцияга каршы идеологияны, моралдык-этикалык, адеп-ахлактык жана баалуулук багыттарды калыптандыруу',
            chapter2Row2Actions: '1. Мамлекеттик органдардын жана ЖӨБО кызматчыларынын этика ченемдерин сактоосун камсыз кылуу...<br>2. Мамлекеттик кызмат жана жергиликтүү өз алдынча башкаруу иштери боюнча...<br>3. Кызматчылар тарабынан этиканын принциптерин жана ченемдерин сактоо...',
            chapter2Row2Deadline: '2025-2027-жылдар',
            chapter2Row2Results: '1. Жыл сайын мониторинг жана талдоо жүргүзүлөт...<br>2. Мониторингдин жыйынтыктары расмий сайттарга жайгаштырылат...<br>3. Атайын программалар иштелип чыкты жана ишке ашырылып жатат',
            chapter2Row2Responsible: 'ЖӨБО, мамлекеттик органдар',
            chapter2Row2Funding: 'Республикалык бюджет',

            chapter2Row3Task: 'Мамлекеттик жана муниципалдык кызматчылардын кесиптик компетенциясын жогорулатуу...',
            chapter2Row3Actions: 'Кызыкчылыктардын кагылышуусун башкарууга... коррупцияга каршы окутуу системасын өнүктүрүү',
            chapter2Row3Deadline: '2025-2027-жылдар',
            chapter2Row3Results: 'Типтүү программа бекитилген. Кызматчылардын 30%дан кем эмесин камтуу менен окутуу тренингдери туруктуу негизде өткөрүлөт',
            chapter2Row3Responsible: 'ЖӨБО, мамлекеттик органдар',
            chapter2Row3Funding: 'Республикалык бюджет',

            chapter2Row4Task: 'Социалдык чөйрөнүн жана экономиканын тармактарында жарандардын мамлекеттик бийлик органдары менен өз ара аракеттенүүсүндө коррупциялык тобокелдиктерди минималдаштыруу',
            chapter2Row4Actions: '1. Бийлик органдарынын жарандар жана жеке сектор менен өз ара аракеттенүү процесстерин автоматташтырууга багытталган...<br>2. "Түндүк" ведомстволор аралык электрондук өз ара аракеттенүү системасы аркылуу...<br>3. Мамлекеттик органдарда жана ЖӨБО уруксат берүүчү документтерди берүү...',
            chapter2Row4Deadline: '2025-жыл, 2025-2026-жылдар, 2025-2027-жылдар',
            chapter2Row4Results: 'Жол-жоболордун айкындуулугун жана ачыктыгын камсыз кылууга... багытталган ченемдик укуктук актылар кабыл алынды',
            chapter2Row4Responsible: 'ЖӨБО, мамлекеттик органдар',
            chapter2Row4Funding: 'Республикалык бюджет',

            chapter2Row5Task: '"Мамлекеттик жана муниципалдык кызмат көрсөтүүлөр жөнүндө" Кыргыз Республикасынын Мыйзамын... өркүндөтүү',
            chapter2Row5Actions: '1. "Мамлекеттик жана муниципалдык кызмат көрсөтүүлөр жөнүндө" Кыргыз Республикасынын Мыйзамына өзгөртүүлөрдү киргизүү...<br>2. Мамлекеттик жана муниципалдык кызмат көрсөтүүгө юридикалык/жеке жактарды мамлекеттик аккредитациялоо...',
            chapter2Row5Deadline: '2025-жылдын I жарым жылдыгы, 2025-жылдын III кварталы',
            chapter2Row5Results: 'Мыйзам кабыл алынды. Типтүү жобону бекитүү жөнүндө ченемдик укуктук акт кабыл алынды',
            chapter2Row5Responsible: 'ОЮ, ЖӨБО, мамлекеттик органдар',
            chapter2Row5Funding: 'Республикалык бюджет',

            chapter3Row1Task: 'Жарандардын мамлекеттик бийлик органдары менен өз ара аракеттенүүсүндө коррупциялык көрүнүштөрдүн алдын алуу',
            chapter3Row1Actions: 'Коррупцияга жол бербөө жана алдын алуу боюнча чараларды көрүү менен коррупциялык укук бузууларга байланыштуу мамлекеттик органдарга жана ЖӨБО келип түшкөн кайрылууларды (даттанууларды) кароо жана талдоо жүргүзүү',
            chapter3Row1Deadline: '2025-2027-жылдар',
            chapter3Row1Results: 'Ички укуктук актылар аркылуу Коррупцияны алдын алуу чараларын көрүү менен кайрылууларга талдоо жүргүзүүнүн тартиби жөнгө салынды, ал жыл сайын жүргүзүлөт',
            chapter3Row1Responsible: 'ЖӨБО, мамлекеттик органдар',
            chapter3Row1Funding: 'Талап кылынбайт',

            chapter3Row2Task: 'Жаратылышты пайдалануу жана жер казынасын пайдалануу чөйрөсүндө ачык-айкындуулукту камсыз кылуу',
            chapter3Row2Actions: 'Кен казып алуу тармактарынын жана жаратылышты пайдалануучулардын айкындуулук демилгесинин сунуштамаларын эл аралык стандартка ылайык аткарууну камсыздоо',
            chapter3Row2Deadline: '2025-2027-жылдар',
            chapter3Row2Results: 'Жаратылышты пайдалануу жана жер казынасын пайдалануу чөйрөсүндө мамлекеттик жана юридикалык жактардын ишинин ачык-айкындуулугу жогорулады',
            chapter3Row2Responsible: 'ЖӨБО, мамлекеттик органдар',
            chapter3Row2Funding: 'Республикалык бюджет',

            chapter3Row3Task: 'Бюджеттик процесстердин ачык-айкындуулугун жогорулатуу, контролдоо системасын өркүндөтүү жана финансылык тартипти бекемдөө',
            chapter3Row3Actions: '1. Төмөнкүлөргө багытталган бюджеттик укуктук мамилелер чөйрөсүндөгү ченемдик укуктук актыларды колдонууга талдоо жүргүзүү...',
            chapter3Row3Deadline: '2025-жылдын II жарым жылдыгы',
            chapter3Row3Results: 'Аналитикалык кат түзүлдү',
            chapter3Row3Responsible: 'ЖӨБО, мамлекеттик органдар',
            chapter3Row3Funding: 'Республикалык бюджет',

            chapter4Row1Task: 'Ишкердик субъекттеринин укуктарын коргоонун укуктук инструменттерин ишке киргизүү',
            chapter4Row1Actions: '1. ЭКМнын расмий порталында ишкердик субъекттерин каттоодо...<br>2. Прокуратура органдарында аларды каттагандан кийин гана...<br>3. Кыргыз Республикасында электрондук башкарууну ишке киргизүү...',
            chapter4Row1Deadline: '2025-2026-жылдар',
            chapter4Row1Results: 'Коррупциялык тобокелдиктерди жоюу. ... Мамлекеттик башкаруу системасында санариптик технологияларды ишке киргизүү процесстерин аяктоо боюнча чаралар көрүлдү',
            chapter4Row1Responsible: 'ЭКМ, райондук салык кызматы, укук коргоо органдары, мамлекеттик органдар',
            chapter4Row1Funding: 'Республикалык бюджет',

            chapter4Row2Task: 'Мамлекеттик башкаруу системасын санариптештирүү',
            chapter4Row2Actions: '1. Маалыматты иштеп чыгуунун, берүүнүн жана жайылтуунун...<br>2. Учурдагы бюджеттик процесстерге талдоо жүргүзүү...<br>3.Төмөнкүлөрдү камтыган жүк ташууларды контролдоо боюнча...',
            chapter4Row2Deadline: '2025-2026-жылдар, 2025-жылдын I жарым жылдыгы, 2025-жылдын II кварталы, 2025-жыл',
            chapter4Row2Results: 'Мамлекеттик башкаруу системасында санариптик технологияларды ишке киргизүү процесстерин аяктоо боюнча чаралар көрүлдү...',
            chapter4Row2Responsible: 'ЖӨБО, мамлекеттик органдар, райондук салык кызматы',
            chapter4Row2Funding: 'Республикалык бюджет',

            chapter4Row3Task: 'Жүк ташууларды контролдоо боюнча системаны ишке киргизүү',
            chapter4Row3Actions: 'Ченөө бирдейлигин камсыздоо жаатында маалыматтык фондду иштеп чыгуу',
            chapter4Row3Deadline: '2025-2027-жылдар, 2025-2026-жылдар',
            chapter4Row3Results: 'Мамлекеттик органдар менен өндүрүш секторлорунун ортосундагы өз ара аракеттенүүнүн ачык-айкын автоматташтырылган механизми...',
            chapter4Row3Responsible: 'ЖӨБО, райондук салык кызматы, мамлекеттик органдар',
            chapter4Row3Funding: 'Республикалык бюджет',

            chapter4Row4Task: 'Стандартташтыруу жана метрология жаатындагы акы төлөнүүчү мамлекеттик кызмат көрсөтүүлөрдү санариптештирүү',
            chapter4Row4Actions: '1. Лицензияларды жана уруксаттарды берүүнү кошкондо...<br>2. ЖӨБОдо жерди пайдалануу боюнча иштин санариптик эсебин...',
            chapter4Row4Deadline: '2025-2027-жылдар, 2025-2026-жылдар',
            chapter4Row4Results: 'Мамлекеттик органдар менен өндүрүш секторлорунун ортосундагы өз ара аракеттенүүнүн ачык-айкын автоматташтырылган механизми...',
            chapter4Row4Responsible: 'ЖӨБО, райондук салык кызматы, мамлекеттик органдар',
            chapter4Row4Funding: 'Республикалык бюджет, эл аралык донорлор, гранттык каражаттар',

            chapter4Row5Task: 'Мамлекеттик жана муниципалдык кызмат көрсөтүүлөрдү, административдик жол-жоболорду санариптештирүү',
            chapter4Row5Actions: 'Архитектура, курулуш жана турак жай-коммуналдык чарба чөйрөсүндөгү...',
            chapter4Row5Deadline: '2025-жыл, 2025-2027-жылдар',
            chapter4Row5Results: 'Курулуш чөйрөсүндө уруксат берүүчү документтерди даярдоо жана берүү...',
            chapter4Row5Responsible: 'ЖӨБО, райондук шаар курулуш, архитектура башкармасы, райондук жер ресурстар кадастр Мамагентинин филиалы, мамлекеттик органдар',
            chapter4Row5Funding: 'Республикалык бюджет',

            chapter4Row6Task: 'Санариптештирүүнүн алкагында мамлекеттик (муниципалдык) кызматтарды алуу мүмкүнчүлүктөрү жөнүндө маалымдуулук боюнча...',
            chapter4Row6Actions: 'Калктуу конуштардын коомдук жерлеринде укук бузуулардын жана кылмыштуулуктун алдын алуу маселелерин...',
            chapter4Row6Deadline: '2025-2027-жылдар',
            chapter4Row6Results: '"Коопсуз шаар" долбоору географиялык камтууну жана функционалын кеңейтүүдө',
            chapter4Row6Responsible: 'ЖӨБО, РИИБ, мамлекеттик органдар',
            chapter4Row6Funding: 'Республикалык бюджет',

            chapter4Row7Task: '"Кылмыштардын бирдиктүү реестри" (КБР) АМСти модернизациялоо',
            chapter4Row7Actions: 'Мамлекеттик органдардын жана ЖӨБО расмий сайттарында алардын иши жөнүндө...',
            chapter4Row7Deadline: '2025-2027-жылдар',
            chapter4Row7Results: 'Мамлекеттик органдардын жана ЖӨБО расмий сайттарында... маалыматтарды жарыялоо боюнча чаралар көрүлдү...',
            chapter4Row7Responsible: 'Укук коргоо органдары, ЖӨБО, мамлекеттик органдар',
            chapter4Row7Funding: 'Республикалык бюджет',

            chapter5Row1Task: 'Коррупцияга каршы маданиятты өнүктүрүү, коомдо коррупцияга сабырсыздык мамилени чагылдырган баалуулуктар системасын сактоо жана бекемдөө',
            chapter5Row1Actions: 'Коррупцияга каршы маалыматтык саясаттын мамлекеттик программасын ишке ашыруу процессин...',
            chapter5Row1Deadline: '2025-2027-жылдар',
            chapter5Row1Results: 'Жарандардын укуктук аңсезиминин жана укуктук маданиятынын деңгээлин жогорулатууга...',
            chapter5Row1Responsible: 'ЖМА, ЖӨБО, мамлекеттик органдар',
            chapter5Row1Funding: 'Республикалык бюджет. Өнүктүрүү боюнча өнөктөштөрдүн каражаттары',

            chapter6Row1Task: 'Коррупциянын деңгээлин өлчөөнүн улуттук системасын иштеп чыгуу жана ишке ашыруу',
            chapter6Row1Actions: '1. Бириккен Улуттар Уюмунун Коррупцияга каршы конвенциясынын...<br>2. Кыргыз Республикасынын Экономикалык кызматташтык жана өнүктүрүү...',
            chapter6Row1Deadline: '2026-2027-жылдар, Туруктуу',
            chapter6Row1Results: 'Жүргүзүлүп жаткан изилдөөлөр социалдык, экономикалык жана укуктук чөйрөдө...',
            chapter6Row1Responsible: 'ЖӨБО, мамлекеттик органдар, ӨЭУ',
            chapter6Row1Funding: 'Республикалык бюджет',

            chapter7Row1Task: 'Коррупцияга каршы аракеттенүү жаатында эл аралык кызматташтыктын жана өз ара аракеттенүүнүн натыйжалуулугун жогорулатуу жана өнүктүрүү',
            chapter7Row1Actions: '1. Көз карандысыз Мамлекеттердин Шериктештигинин...<br>2. Кыргыз Республикасынын Европа Кеңешинин...<br>3. Эл аралык коррупцияга каршы ченемдерди, стандарттарды...',
            chapter7Row1Deadline: 'Туруктуу, 2025-2027-жылдар',
            chapter7Row1Results: 'Кыргыз Республикасы абройлуу эл аралык уюмдарда активдүү катышууда...',
            chapter7Row1Responsible: 'ЖӨБО, мамлекеттик органдар',
            chapter7Row1Funding: 'Республикалык бюджет',

            chapter7Row2Task: 'Коррупцияга каршы аракеттенүү жаатындагы эл аралык рейтингдерде Кыргыз Республикасынын позициясын жакшыртуу',
            chapter7Row2Actions: 'Стратегияны ишке ашыруу боюнча коррупцияга каршы иш-чараларды каржылоо',
            chapter7Row2Deadline: '2025-жылдын I кварталы',
            chapter7Row2Results: 'Мамлекеттик бийлик органдары жана ЖӨБО тарабынан...',
            chapter7Row2Responsible: 'ЖӨБО, мамлекеттик органдар',
            chapter7Row2Funding: 'Республикалык бюджет',

            chapter7Row3Task: 'Стратегияны ишке ашыруу механизмдерин иштеп чыгуу',
            chapter7Row3Actions: 'Стратегияны ишке ашыруу боюнча коррупцияга каршы иш-чараларды каржылоо',
            chapter7Row3Deadline: '2025-2027-жылдар',
            chapter7Row3Results: 'Стратегиядан келип чыккан коррупцияга каршы иш-чаралар...',
            chapter7Row3Responsible: 'ЖӨБО, мамлекеттик органдар',
            chapter7Row3Funding: 'Республикалык и жергиликтүү бюджеттер',

            chapter8Row1Task: 'Мамлекеттик стратегияны ишке ашыруу процесстерин координациялоо жана контролдоо',
            chapter8Row1Actions: 'Коррупцияга каршы пландуу иш-чаралардын I этабын ишке ашыруунун жыйынтыктарын...',
            chapter8Row1Deadline: '2027-жылдын I жарым жылы',
            chapter8Row1Results: 'Талдоонун негизинде 2028-2030-жылдарга... Иш-чаралар планы даярдалды жана бекитилди',
            chapter8Row1Responsible: 'ЖӨБО, мамлекеттик органдар',
            chapter8Row1Funding: 'Республикалык бюджет',

            chapter8Row2Task: 'Коррупцияга каршы иш-чараларды өз убагында жана толук финансылык камсыздоо',
            chapter8Row2Actions: 'Натыйжалуулук жана таасирдүүлүк индикаторлоруна негизделген...',
            chapter8Row2Deadline: '2027-жылдын I жарым жылы',
            chapter8Row2Results: 'Талдоонун негизинде 2028-2030-жылдарга... Иш-чаралар планы даярдалды жана бекитилди',
            chapter8Row2Responsible: 'ЖӨБО, мамлекеттик органдар',
            chapter8Row2Funding: 'Консолидацияланган бюджет. Өнүктүрүү боюнча өнөктөштөрдүн каражаттары',

            chapter8Row3Task: 'Пландуу иш-чараларды актуалдаштыруу, жаңы милдеттерди коюу...',
            chapter8Row3Actions: 'Сандык жана сапаттык көрсөткүчтөрдү эске алуу менен коррупцияга каршы иш-чараларды...',
            chapter8Row3Deadline: '2025-жылдын I жарым жылдыгы',
            chapter8Row3Results: 'Мониторинг жүргүзүүнүн тартиби (методикасы) и отчеттун бирдиктүү формасы иштелип чыкты...',
            chapter8Row3Responsible: 'ЖӨБО, мамлекеттик органдар',
            chapter8Row3Funding: 'Республикалык бюджет'
        },
        ru: {
            // Заголовки и кнопки
            mainTitle: 'Планы и цели',
            mainSubtitle: 'Приложение к приказу Кара-Кулжинской местной государственной администрации от 27 августа 2024 года № 01-12/275',
            planTitle: 'План мероприятий по реализации Государственной стратегии по противодействию коррупции на 2025-2030 годы',

            // Заголовки таблицы
            col1: '№',
            col2: 'Задачи',
            col3: 'Мероприятия',
            col4: 'Сроки',
            col5: 'Результаты',
            col6: 'Ответственные',
            col7: 'Финансирование',

            // Главы
            chapter1Title: 'Глава 1. Совершенствование антикоррупционного законодательства и обеспечение эффективности его применения на практике',
            chapter2Title: 'Глава 2. Предупреждение коррупционных проявлений во взаимодействии граждан с органами государственной власти в сферах социальной сферы и экономики',
            chapter3Title: 'Глава 3. Совершенствование систем управления государственными средствами, финансового контроля и процедур закупок',
            chapter4Title: 'Глава 4. Развитие процессов цифровизации и внедрение информационных технологий в деятельность государственных и муниципальных структур как одной из эффективных мер борьбы с коррупцией на современном этапе',
            chapter5Title: 'Глава 5. Исследование коррупции',
            chapter6Title: 'Глава 6. Международное сотрудничество в сфере противодействия коррупции',
            chapter7Title: 'Глава 7. Механизмы реализации Стратегии, финансовые ресурсы',
            chapter8Title: 'Глава 8. Координация, мониторинг и оценка процессов реализации Стратегии',

            // Текст внутри глав
            chapter1Row1Task: 'Организация учебных тренингов по применению антикоррупционного законодательства для сотрудников государственных органов и органов местного самоуправления',
            chapter1Row1Actions: '2026 год',
            chapter1Row1Deadline: 'Проводятся учебные тренинги по применению вновь принятых законодательных актов в сфере противодействия коррупции для сотрудников государственных органов и ОМСУ на основе программы учебной системы',
            chapter1Row1Results: 'ГУМС, ГСУ, МСУ, государственные органы',
            chapter1Row1Responsible: 'Республиканский бюджет в пределах средств, предусмотренных для государственных органов. Средства партнеров по развитию',
            chapter1Row1Funding: 'Республиканский бюджет в пределах средств, предусмотренных для государственных органов. Средства партнеров по развитию',

            chapter2Row1Task: 'Снижение коррупционной мотивации сотрудников системы государственного управления и местного самоуправления',
            chapter2Row1Actions: 'Разработка комплекса мер по повышению престижа и привлекательности работы в государственных органах и ОМСУ и снижению наличия коррупционных рисков в секторе государственного управления, улучшению условий для привлечения высококвалифицированных специалистов и сохранения кадрового потенциала',
            chapter2Row1Deadline: '2025-2027 годы',
            chapter2Row1Results: 'Принимаются меры по улучшению системы отбора и подбора кадров на государственные и муниципальные должности',
            chapter2Row1Responsible: 'ОМСУ, государственные органы',
            chapter2Row1Funding: 'В пределах средств, выделенных для государственных органов и ОМСУ',

            chapter2Row2Task: 'Формирование в системе государственного управления антикоррупционной идеологии, морально-этических, нравственных и ценностных ориентиров',
            chapter2Row2Actions: '1. Обеспечение соблюдения норм этики сотрудниками государственных органов и ОМСУ...<br>2. По вопросам государственной службы и местного самоуправления...<br>3. Соблюдение принципов и норм этики сотрудниками...',
            chapter2Row2Deadline: '2025-2027 годы',
            chapter2Row2Results: '1. Ежегодно проводится мониторинг и анализ...<br>2. Результаты мониторинга размещаются на официальных сайтах...<br>3. Разработаны и реализуются специальные программы',
            chapter2Row2Responsible: 'ОМСУ, государственные органы',
            chapter2Row2Funding: 'Республиканский бюджет',

            chapter2Row3Task: 'Повышение профессиональной компетенции государственных и муниципальных служащих...',
            chapter2Row3Actions: 'Развитие системы антикоррупционного обучения... по управлению конфликтами интересов',
            chapter2Row3Deadline: '2025-2027 годы',
            chapter2Row3Results: 'Утверждена типовая программа. Тренинги по обучению проводятся на постоянной основе с охватом не менее 30% служащих',
            chapter2Row3Responsible: 'ОМСУ, государственные органы',
            chapter2Row3Funding: 'Республиканский бюджет',

            chapter2Row4Task: 'Минимизация коррупционных рисков во взаимодействии граждан с органами государственной власти в сферах социальной сферы и экономики',
            chapter2Row4Actions: '1. Автоматизация процессов взаимодействия органов власти с гражданами и частным сектором...<br>2. Через межведомственную электронную систему "Түндүк"...<br>3. Выдача разрешительных документов в государственных органах и ОМСУ...',
            chapter2Row4Deadline: '2025 год, 2025-2026 годы, 2025-2027 годы',
            chapter2Row4Results: 'Приняты нормативные правовые акты, направленные на обеспечение прозрачности и открытости процедур...',
            chapter2Row4Responsible: 'ОМСУ, государственные органы',
            chapter2Row4Funding: 'Республиканский бюджет',

            chapter2Row5Task: 'Совершенствование Закона Кыргызской Республики "О государственных и муниципальных услугах"...',
            chapter2Row5Actions: '1. Внесение изменений в Закон Кыргызской Республики "О государственных и муниципальных услугах"...<br>2. Государственная аккредитация юридических/физических лиц на оказание государственных и муниципальных услуг...',
            chapter2Row5Deadline: 'I полугодие 2025 года, III квартал 2025 года',
            chapter2Row5Results: 'Закон принят. Принят нормативный правовой акт об утверждении типового положения',
            chapter2Row5Responsible: 'ГУМС, ОМСУ, государственные органы',
            chapter2Row5Funding: 'Республиканский бюджет',

            chapter3Row1Task: 'Предупреждение коррупционных проявлений во взаимодействии граждан с органами государственной власти',
            chapter3Row1Actions: 'Рассмотрение и проведение анализа обращений (жалоб), поступивших в государственные органы и ОМСУ, связанных с коррупционными правонарушениями, с принятием мер по недопущению и предупреждению коррупции',
            chapter3Row1Deadline: '2025-2027 годы',
            chapter3Row1Results: 'Внутренними правовыми актами урегулирован порядок проведения анализа обращений с принятием мер по предупреждению коррупции, который проводится ежегодно',
            chapter3Row1Responsible: 'ОМСУ, государственные органы',
            chapter3Row1Funding: 'Не требуется',

            chapter3Row2Task: 'Обеспечение прозрачности в сфере природопользования и недропользования',
            chapter3Row2Actions: 'Обеспечение выполнения рекомендаций Инициативы прозрачности добывающих отраслей и природопользователей в соответствии с международным стандартом',
            chapter3Row2Deadline: '2025-2027 годы',
            chapter3Row2Results: 'Повышена прозрачность деятельности государственных и юридических лиц в сфере природопользования и недропользования',
            chapter3Row2Responsible: 'ОМСУ, государственные органы',
            chapter3Row2Funding: 'Республиканский бюджет',

            chapter3Row3Task: 'Повышение прозрачности бюджетных процессов, совершенствование системы контроля и укрепление финансовой дисциплины',
            chapter3Row3Actions: '1. Проведение анализа применения нормативных правовых актов в сфере бюджетных правоотношений, направленных на...',
            chapter3Row3Deadline: 'II полугодие 2025 года',
            chapter3Row3Results: 'Составлена аналитическая записка',
            chapter3Row3Responsible: 'ОМСУ, государственные органы',
            chapter3Row3Funding: 'Республиканский бюджет',

            chapter4Row1Task: 'Внедрение правовых инструментов защиты прав субъектов предпринимательства',
            chapter4Row1Actions: '1. При регистрации субъектов предпринимательства на официальном портале ЭКМ...<br>2. Только после их регистрации в органах прокуратуры...<br>3. Внедрение электронного управления в Кыргызской Республике...',
            chapter4Row1Deadline: '2025-2026 годы',
            chapter4Row1Results: 'Устранены коррупционные риски. ... Приняты меры по завершению процессов внедрения цифровых технологий в систему государственного управления',
            chapter4Row1Responsible: 'ЭКМ, районная налоговая служба, правоохранительные органы, государственные органы',
            chapter4Row1Funding: 'Республиканский бюджет',

            chapter4Row2Task: 'Цифровизация системы государственного управления',
            chapter4Row2Actions: '1. Обработка, передача и распространение информации...<br>2. Анализ текущих бюджетных процессов...<br>3. По контролю за грузоперевозками, включающий...',
            chapter4Row2Deadline: '2025-2026 годы, I полугодие 2025 года, II квартал 2025 года, 2025 год',
            chapter4Row2Results: 'Приняты меры по завершению процессов внедрения цифровых технологий в систему государственного управления...',
            chapter4Row2Responsible: 'ОМСУ, государственные органы, районная налоговая служба',
            chapter4Row2Funding: 'Республиканский бюджет',

            chapter4Row3Task: 'Внедрение системы по контролю за грузоперевозками',
            chapter4Row3Actions: 'Разработка информационного фонда в области обеспечения единства измерений',
            chapter4Row3Deadline: '2025-2027 годы, 2025-2026 годы',
            chapter4Row3Results: 'Прозрачный автоматизированный механизм взаимодействия между государственными органами и производственными секторами...',
            chapter4Row3Responsible: 'ОМСУ, районная налоговая служба, государственные органы',
            chapter4Row3Funding: 'Республикалык бюджет',

            chapter4Row4Task: 'Цифровизация платных государственных услуг в сфере стандартизации и метрологии',
            chapter4Row4Actions: '1. Включая выдачу лицензий и разрешений...<br>2. Цифровой учет работы по землепользованию в ОМСУ...',
            chapter4Row4Deadline: '2025-2027 годы, 2025-2026 годы',
            chapter4Row4Results: 'Прозрачный автоматизированный механизм взаимодействия между государственными органами и производственными секторами...',
            chapter4Row4Responsible: 'ОМСУ, районная налоговая служба, государственные органы',
            chapter4Row4Funding: 'Республиканский бюджет, международные доноры, грантовые средства',

            chapter4Row5Task: 'Цифровизация государственных и муниципальных услуг, административных процедур',
            chapter4Row5Actions: 'В сфере архитектуры, строительства и жилищно-коммунального хозяйства...',
            chapter4Row5Deadline: '2025 год, 2025-2027 годы',
            chapter4Row5Results: 'Подготовка и выдача разрешительных документов в сфере строительства...',
            chapter4Row5Responsible: 'ОМСУ, районное управление градостроительства и архитектуры, районный филиал Госрегистра, государственные органы',
            chapter4Row5Funding: 'Республиканский бюджет',

            chapter4Row6Task: 'Повышение осведомленности о возможностях получения государственных (муниципальных) услуг в рамках цифровизации',
            chapter4Row6Actions: 'Вопросы предупреждения правонарушений и преступности в общественных местах населенных пунктов...',
            chapter4Row6Deadline: '2025-2027 годы',
            chapter4Row6Results: 'Проект "Безопасный город" расширяет географический охват и функционал',
            chapter4Row6Responsible: 'ОМСУ, РОВД, государственные органы',
            chapter4Row6Funding: 'Республиканский бюджет',

            chapter4Row7Task: 'Модернизация АИС "Единый реестр преступлений" (ЕРП)',
            chapter4Row7Actions: 'Об их работе на официальных сайтах государственных органов и ОМСУ...',
            chapter4Row4Deadline: '2025-2027 годы',
            chapter4Row4Results: 'Приняты меры по опубликованию сведений... на официальных сайтах государственных органов и ОМСУ...',
            chapter4Row4Responsible: 'Правоохранительные органы, ОМСУ, государственные органы',
            chapter4Row4Funding: 'Республиканский бюджет',

            chapter5Row1Task: 'Развитие антикоррупционной культуры, сохранение и укрепление в обществе системы ценностей, отражающей нетерпимое отношение к коррупции',
            chapter5Row1Actions: 'Процесс реализации государственной программы по антикоррупционной информационной политике...',
            chapter5Row1Deadline: '2025-2027 годы',
            chapter5Row1Results: 'Повышение уровня правосознания и правовой культуры граждан...',
            chapter5Row1Responsible: 'ГСУ, ОМСУ, государственные органы',
            chapter5Row1Funding: 'Республиканский бюджет. Средства партнеров по развитию',

            chapter6Row1Task: 'Разработка и реализация национальной системы измерения уровня коррупции',
            chapter6Row1Actions: '1. Конвенции Организации Объединенных Наций против коррупции...<br>2. Экономического сотрудничества и развития Кыргызской Республики...',
            chapter6Row1Deadline: '2026-2027 годы, Постоянно',
            chapter6Row1Results: 'Проводимые исследования в социальной, экономической и правовой сфере...',
            chapter6Row1Responsible: 'ОМСУ, государственные органы, НПО',
            chapter6Row1Funding: 'Республиканский бюджет',

            chapter7Row1Task: 'Повышение эффективности и развитие международного сотрудничества и взаимодействия в сфере противодействия коррупции',
            chapter7Row1Actions: '1. Содружества Независимых Государств...<br>2. Совета Европы Кыргызской Республики...<br>3. Международные антикоррупционные нормы, стандарты...',
            chapter7Row1Deadline: 'Постоянно, 2025-2027 годы',
            chapter7Row1Results: 'Кыргызская Республика активно участвует в авторитетных международных организациях...',
            chapter7Row1Responsible: 'ОМСУ, государственные органы',
            chapter7Row1Funding: 'Республикалык бюджет',

            chapter7Row2Task: 'Улучшение позиции Кыргызской Республики в международных антикоррупционных рейтингах',
            chapter7Row2Actions: 'Финансирование антикоррупционных мероприятий по реализации Стратегии',
            chapter7Row2Deadline: 'I квартал 2025 года',
            chapter7Row2Results: 'Органами государственной власти и ОМСУ...',
            chapter7Row2Responsible: 'ОМСУ, государственные органы',
            chapter7Row2Funding: 'Республиканский бюджет',

            chapter7Row3Task: 'Разработка механизмов реализации Стратегии',
            chapter7Row3Actions: 'Финансирование антикоррупционных мероприятий по реализации Стратегии',
            chapter7Row3Deadline: '2025-2027 годы',
            chapter7Row3Results: 'Антикоррупционные мероприятия, вытекающие из Стратегии...',
            chapter7Row3Responsible: 'ОМСУ, государственные органы',
            chapter7Row3Funding: 'Республиканский и местный бюджеты',

            chapter8Row1Task: 'Координация и контроль процессов реализации Государственной стратегии',
            chapter8Row1Actions: 'Результаты реализации I этапа плановых антикоррупционных мероприятий...',
            chapter8Row1Deadline: 'I полугодие 2027 года',
            chapter8Row1Results: 'На основе анализа подготовлен и утвержден план мероприятий... на 2028-2030 годы',
            chapter8Row1Responsible: 'ОМСУ, государственные органы',
            chapter8Row1Funding: 'Республиканский бюджет',

            chapter8Row2Task: 'Своевременное и полное финансовое обеспечение антикоррупционных мероприятий',
            chapter8Row2Actions: 'На основе индикаторов эффективности и результативности...',
            chapter8Row2Deadline: 'I полугодие 2027 года',
            chapter8Row2Results: 'На основе анализа подготовлен и утвержден план мероприятий... на 2028-2030 годы',
            chapter8Row2Responsible: 'ОМСУ, государственные органы',
            chapter8Row2Funding: 'Консолидированный бюджет. Средства партнеров по развитию',

            chapter8Row3Task: 'Актуализация плановых мероприятий, постановка новых задач...',
            chapter8Row3Actions: 'Антикоррупционные мероприятия с учетом количественных и качественных показателей...',
            chapter8Row3Deadline: 'I полугодие 2025 года',
            chapter8Row3Results: 'Разработана методика мониторинга и единая форма отчета...',
            chapter8Row3Responsible: 'ОМСУ, государственные органы',
            chapter8Row3Funding: 'Республиканский бюджет'
        }
    };

    // Функция для обновления контента на странице
    const updatePageContent = (lang) => {
        document.querySelectorAll('[data-key]').forEach(element => {
            const key = element.getAttribute('data-key');
            if (translations[lang] && translations[lang][key]) {
                element.innerHTML = translations[lang][key];
            }
        });

        // Обновляем атрибут lang для HTML-элемента
        document.documentElement.lang = lang;

        // Обновляем активную кнопку
        document.querySelectorAll('.lang-button').forEach(btn => btn.classList.remove('active'));
        document.getElementById(`lang-${lang}`).classList.add('active');
    };

    // Обработчики событий для кнопок
    document.getElementById('lang-kg').addEventListener('click', () => updatePageContent('kg'));
    document.getElementById('lang-ru').addEventListener('click', () => updatePageContent('ru'));

    // Устанавливаем язык по умолчанию
    updatePageContent('ru');
});